seifflifel/Synthewi/sdkconfig.defaults
# Default sdkconfig for Synthewi project

# Target settings (ESP32-S3)
CONFIG_IDF_TARGET="esp32s3"

# Logging
CONFIG_LOG_DEFAULT_LEVEL=3

# USB Configuration - USB OTG Device Mode for native MIDI
# (To switch back to Serial/JTAG monitor, use: idf.py menuconfig)
CONFIG_USB_OTG_SUPPORTED=y

# TinyUSB class selection
CONFIG_TINYUSB_CDC_ENABLED=n
CONFIG_TINYUSB_MSC_ENABLED=n
CONFIG_TINYUSB_MIDI_COUNT=1

# Device Descriptor
CONFIG_TINYUSB_DESC_BCD_DEVICE=0x0100
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="Synthewi"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="Touch MIDI Controller"
CONFIG_TINYUSB_DESC_SERIAL_STRING="123456"

# Disable Serial/JTAG for now (re-enable via menuconfig when needed for debugging)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=n
